# TilePattern Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TilePattern Class
Members See Also
---
An object representing a tile pattern that may be applied to a DividedSurface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class TilePattern : ElementType
```

Visual Basic
---
```text
Public Class TilePattern _
	Inherits ElementType
```

Visual C++
---
```text
public ref class TilePattern : public ElementType
```

# Remarks
TilePatterns cannot be created. A fixed selection is built into each Conceptual Mass family. TilePatterns can be retrieved by key from the Revit::DB::Document::Settings::TilePatternTable object.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..TilePattern
# See Also
TilePattern Members
Autodesk.Revit.DB Namespace